sleepster/app/controllers/bands_controller.rb

  def index
    @band = Band.all
---
SELECT "bands".* FROM "bands"