sleepster/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$.5A8wSD4Odu7WYEDShQ9g.uhlYYrDZy8ezQSuRnzvcX0sjy8CCg3m"], ["updated_at", "2021-03-08 21:43:14.482794"], ["id", 5]]
---
  def update
    # PATCH /users/:id
    user = User.find_by(id: params[:id])

    if user
      if user.update(user_params)